{
  "all": [
    {
      "id": 1,
      "name": "Ala Kahakai National Historic Trail",
      "image": "https://www.nps.gov/common/uploads/structured_data/3C86C7EB-1DD8-B71B-0BF2A10341617580.jpg",
      "address": "73-4786 Kanalani Street, #14 Kailua-Kona 96740",
      "island": "Big Island",
      "description": "Established in 2000 to preserve, protect and interpret traditional Native Hawaiian culture and natural resources, Ala Kahakai National Historic Trail is a 175 mile corridor encompassing a network of culturally and historically significant trails. This \"trail by the sea\" traverses wahi pana (storied landscapes), ancient Hawaiian sites and over 200 ahupuaʻa (traditional land divisions). Connect now!"
    },
    {
      "id": 2,
      "name": "Haleakalā National Park",
      "image": "https://mauiinn.com/wp-content/uploads/2016/05/Haleakala-National-Park-1500x609.jpg",
      "address": "Haleakalā National Park Route 378 Kula, HI 96790",
      "island": "Maui",
      "description": "This special place vibrates with stories of ancient and modern Hawaiian culture and protects the bond between the land and its people. The park also cares for endangered species, some of which exist nowhere else. Come visit this special place - renew your spirit amid stark volcanic landscapes and sub-tropical rain forest with an unforgettable hike through the backcountry."
    },
    {
      "id": 3,
      "name": "Hawaiʻi Volcanoes National Park",
      "image": "https://www.nps.gov/common/uploads/structured_data/C4E8415A-08E5-5976-833F494FFCA3FFE6.jpg",
      "address": "1 Crater Rim Drive Hawaii National Park, HI 96718",
      "island": "Big Island",
      "description": "Hawai‘i Volcanoes National Park protects some of the most unique geological, biological, and cherished cultural landscapes in the world. Extending from sea level to 13,681 feet, the park encompasses the summits of two of the world's most active volcanoes - Kīlauea and Mauna Loa - and is a designated International Biosphere Reserve and UNESCO World Heritage Site."
    },
    {
      "id": 4,
      "name": "Diamond Head State Monument",
      "image": "https://camping.ehawaii.gov/camping/resources/spc,resource,57855,p,2,null,DHview.jpg",
      "address": "Diamond Head Rd Honolulu, HI 96815",
      "island": "Oahu",
      "description": "The unique profile of Diamond Head (Lē‘ahi) sits prominently near the eastern edge of Waikiki’s coastline. Hawaii’s most recognized landmark is known for its historic hiking trail, stunning coastal views, and military history. Diamond Head State Monument encompasses over 475 acres, including the interior and outer slopes of the crater."
    },
    {
      "id": 5,
      "name": "Kalaupapa National Historical Park",
      "image": "https://www.nps.gov/common/uploads/structured_data/3C79B6CD-1DD8-B71B-0BB2B4265DD8C023.jpg",
      "address": "189 Kaiulani St, Kalaupapa, HI 96742",
      "island": "Moloka‘i",
      "description": "When Hansen's disease (leprosy) was introduced to the Hawaiian Islands, King Kamehameha V banished all afflicted to the isolated Kalaupapa peninsula on the north shore of Molokai. Since 1866, more than 8000 people, mostly Hawaiians, have died at Kalaupapa. Once a prison, Kalaupapa is now refuge for the few remaining residents who are now cured, but were forced to live their lives in isolation"
    },
    {
      "id": 6,
      "name": "Kaloko-Honokōhau National Historical Park",
      "image": "https://www.nps.gov/common/uploads/structured_data/3C821C0B-1DD8-B71B-0B75B0451911CCAA.jpg",
      "address": "73-4786 Kanalani St. Ste 14 Kailua Kona, HI 96740",
      "island": "Big Island",
      "description": "To survive in a hot and arid environment the native Hawaiians (kanaka maoli) used ancient fishing skills, including the building of fishponds, and the knowledge of the location of precious fresh water (wai) that flows into the many brackish pools throughout the park. The spirit of the people (poe) and the knowledge of the elders (kupuna) created a tradition of respect and reverence for this area."
    },
    {
      "id": 7,
      "name": "Pearl Harbor",
      "image": "https://www.nps.gov/common/uploads/structured_data/3C79B3C1-1DD8-B71B-0BBE30E8BE9E1683.jpg",
      "address": "1 Arizona Memorial Pl, Honolulu, HI 96818",
      "island": "Oahu",
      "description": "Tickets for the USS Arizona Memorial program are free. However, there are a limited number of timed tickets. The same day, first come first served ticket distribution program has been discontinued. \n\nTickets can be reserved via www.recreation.gov up to 7 days in advance. Reservations via recreation.gov are strongly recommended as standby seats may not be available (especially during times of peak visitation: Thanksgiving, Winter, Spring & Summer Breaks)."
    },
    {
      "id": 8,
      "name": "Puʻuhonua o Hōnaunau National Historical Park",
      "image": "https://www.nps.gov/common/uploads/structured_data/9794DBEA-C86C-03F5-51F3177CA76DCCCE.jpg",
      "address": "HState Hwy 160, Hōnaunau, HI 96726",
      "island": "Big Island",
      "description": "Imagine you had just broken the sacred laws, the kapu, and the only punishment was death. Your only chance of survival is to elude your pursuers and reach the Puʻuhonua, a place of refuge. The Puʻuhonua protected the kapu breaker, defeated warriors, as well as civilians during the time of battle. No physical harm could come to those who reached the boundaries of the Puʻuhonua."
    },
    {
      "id": 9,
      "name": "Puʻukoholā Heiau National Historic Site",
      "image": "https://www.nps.gov/common/uploads/structured_data/CF9F184A-A873-98A1-95D55AE153E94BA3.jpg",
      "address": "62-3601 Kawaihae Rd, Waimea, HI 96743",
      "island": "Big Island",
      "description": "How many places in America can you walk in the footsteps of a king? Where else has a stranded sailor risen up to become a great chief over an entire island? Where else can you experience the culminating event of a people, foretold from centuries past? Where else can you stand on a beach and watch as sharks pass over a submerged temple? Experience all this and much more – only at Pu'ukoholā Heiau!"
    }
  ],
  "mytrip": [
    
  ]
}